app/controllers/activations_controller.rb

  def new
    @user = User.find_by_perishable_token(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`perishable_token` = 'ukXspp8H_VvwdBSXES76') LIMIT 1

  def create
    @user = User.find_by_perishable_token(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`perishable_token` = 'ukXspp8H_VvwdBSXES76') LIMIT 1