app/controllers/attached_files_controller.rb

  def new
    service = Service.find(params[:service_id])
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)

  def create
    @attached_file = AttachedFile.new(params[:attached_file])
    begin
      @attached_file.save!
---
INSERT INTO `attached_files` (`file_content_type`, `file_file_size`, `file_file_name`, `file_updated_at`, `service_id`, `caption`) VALUES('image/jpeg', 87615, '2006_ningbo_taxi_01.jpg', '2009-12-12 02:54:39', 8, 'Backview')

  def destroy
    @attached_file = AttachedFile.find(params[:id])
    begin
      @attached_file.destroy
---
SELECT * FROM `attached_files` WHERE (`attached_files`.`id` = 5)
DELETE FROM `attached_files` WHERE `id` = 5