app/controllers/comments_controller.rb

SELECT * FROM `comments` ORDER BY created_at ASC
---
  def index
    @comments = Comment.all

SELECT * FROM `comments` WHERE (`comments`.`id` = 1) ORDER BY created_at ASC
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM `services` WHERE (`services`.`id` = 8)
INSERT INTO `comments` (`comment`, `created_at`, `title`, `commentable_type`, `commentable_id`, `updated_at`, `user_id`) VALUES('This is a very good service!', '2009-12-14 22:54:34', 'My comment', NULL, 8, '2009-12-14 22:54:34', NULL)
---
  def create
    commentable = Service.find params[:comment][:commentable_id]
    @comment = commentable.comments.new(params[:comment])
    @comment.user = current_user
    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 1) ORDER BY created_at ASC
DELETE FROM `comments` WHERE `id` = 1
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy