app/controllers/password_resets_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'sohan39@gmail.com') LIMIT 1
---
  def create
    @user = User.find_by_email(params[:user][:email])

UPDATE `users` SET `updated_at` = '2009-12-13 18:06:05', `crypted_password` = 'ec1e91528ceb3ccc92657dcde1b64efa2769640c94f30f930cad84cf8ea5d9da88afe7549b8104ddbb1c71679a32aab7225dfe78f5dc88d1bb4c01776de95cae', `perishable_token` = 'uTnrF8Rm_QDPF9n6wgR8', `password_salt` = 'yiG9ggZ_0G_GN-ZvO2vb', `persistence_token` = 'ba0c141691d3b34446e90fd2388d6952d436c9b59c514631f45de91d307adbaf174e93756f5e59e520a4c71b55722abadb3300f662a3e9b0b503b95224fa25fc' WHERE `id` = 13
---
  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    if(@user.password.blank? || !@user.save)

SELECT * FROM `users` WHERE (`users`.`perishable_token` = '_w4sJ0Mv_2DNR6PLde_6') LIMIT 1
---
  def load_user_by_perishable_token
    @user = User.find_by_perishable_token(params[:id])