app/controllers/ratings_controller.rb

SELECT * FROM `services` WHERE (`services`.`id` = 13)
---
  def create
    service = Service.find params[:service_id]