app/controllers/services_controller.rb

  def index
    if params[:query].present? && params[:service_category_id].blank?
      @services = Service.search_by_text params[:query], params[:page]
      @title = "Services containing \"#{params[:query]}\""
    elsif params[:service_category_id]
      @service_category = ServiceCategory.find params[:service_category_id]
      @services = Service.search_by_category_id(@service_category.id, params[:page], params[:query] || '')
      @title = "#{@service_category.name} Service Providers in Bangladesh"
    elsif params[:user_id]
      user = User.find params[:user_id]
      @services = user.services.paginate :page => params[:page], :per_page => Service::PER_PAGE
---
SELECT * FROM `service_categories` WHERE (`service_categories`.`id` = 3)
SELECT * FROM `users` WHERE (`users`.`id` = '13') LIMIT 1
SELECT * FROM `services` WHERE (`services`.service_category_id = 3) LIMIT 0, 1
SELECT count(*) AS count_all FROM `services` WHERE (`services`.service_category_id = 3)

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)

  def create
    clean_empty_attached_file_attributes
    @service = Service.new(params[:service])
    unless current_user
      begin
        service_provider = User.login_or_create params[:service][:user_attributes]
      rescue Exception => ex
        flash[:error] = ex.message
        @service.initialize_attached_files
        render :new
        return
      end
      @service.user = service_provider
      @service.active = service_provider.active?
    else
      @service.user = current_user
    end
    if @service.save
---
INSERT INTO `attached_files` (`file_content_type`, `file_file_size`, `file_file_name`, `file_updated_at`, `service_id`, `caption`) VALUES('image/jpeg', 84958, '20060930_taxi_900x600.jpg', '2009-12-12 02:23:24', 5, 'Taxi')
INSERT INTO `services` (`service_provider_id`, `created_at`, `title`, `updated_at`, `type`, `user_id`, `service_description`, `service_category_id`) VALUES(NULL, '2009-12-12 02:45:25', 'Navana Taxi Cab', '2009-12-12 02:45:25', NULL, 13, '<p>Navana is the best cab in Dhaka and now offering corporate transport service. Give us a call at 123 765 8766 to book your transport.</p>\r\n<p>Tejgao, Dhaka</p>\r\n<p>navana@navana.com</p>\r\n<p>Open 24/7/365</p>', 3)

  def edit
    @service = Service.find(params[:id])
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)

  def update
    @service = Service.find(params[:id])
    unless current_user == @service.user
      flash[:error] = 'Sorry! You do not have permission to update this ad!'
      render :show
      return
    end
    if @service.update_attributes(params[:service])
---
SELECT * FROM `services` WHERE (`services`.`id` = 5)
UPDATE `services` SET `updated_at` = '2009-12-13 04:49:29', `service_description` = '<p>Navana is the best cab in Dhaka and now offering corporate transport service. Give us a call at 123 765 8766 to book your transport.</p>\r\n<p>Tejgao, Dhaka</p>\r\n<p>navana@navana.com</p>\r\n<p>Open 24/7/365</p>\r\n<p><span style=\"background-color: #ffff00;\"><strong>New Taxi in Town!</strong><span style=\"background-color: #ffffff;\">&nbsp;</span></span></p>', `delta` = 1 WHERE `id` = 8

  def destroy
    @service = Service.find(params[:id])
    unless current_user == @service.user
      flash[:error] = 'Sorry! You do not have permission to delete this ad!'
      render :show
    end
    @service.destroy
---
SELECT * FROM `services` WHERE (`services`.`id` = 1)
DELETE FROM `services` WHERE `id` = 1