app/controllers/service_providers_controller.rb

  def index
    @service_providers = ServiceProvider.all
---
SELECT * FROM `service_providers`

  def show
    @service_provider = ServiceProvider.find(params[:id])
---
SELECT * FROM `service_providers` WHERE (`service_providers`.`id` = 1)

  def edit
    @service_provider = ServiceProvider.find(params[:id])
    @service_provider.services.build if @service_provider.services.blank?
---
SELECT * FROM `service_providers` WHERE (`service_providers`.`id` = 1)
SELECT * FROM `services` WHERE (`services`.service_provider_id = 1)

  def update
    @service_provider = ServiceProvider.find(params[:id])
---
SELECT * FROM `service_providers` WHERE (`service_providers`.`id` = 1)