app/controllers/service_categories_controller.rb

  def index
    @service_categories = ServiceCategory.all
---
SELECT * FROM `service_categories`

  def show
    @service_category = ServiceCategory.find(params[:id])
---
SELECT * FROM `service_categories` WHERE (`service_categories`.`id` = 1)

  def edit
    @service_category = ServiceCategory.find(params[:id])
---
SELECT * FROM `service_categories` WHERE (`service_categories`.`id` = 1)

  def create
    @service_category = ServiceCategory.new(params[:service_category])

    respond_to do |format|
      if @service_category.save
---
INSERT INTO `service_categories` (`name`, `updated_at`, `parent_id`, `created_at`) VALUES('Household Services', '2009-12-11 04:00:41', NULL, '2009-12-11 04:00:41')

  def update
    @service_category = ServiceCategory.find(params[:id])

    respond_to do |format|
      if @service_category.update_attributes(params[:service_category])
---
SELECT * FROM `service_categories` WHERE (`service_categories`.`id` = 1)
UPDATE `service_categories` SET `updated_at` = '2009-12-11 03:57:55', `name` = 'Corporate Services' WHERE `id` = 1