app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '13') LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`name`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `password_salt`, `persistence_token`, `email`, `active`) VALUES('S. M. Sohan', '2009-12-11 22:24:37', '5e8811b4e314b3a705c7a4ce056cb2f65ab31be85b5333db0092d7a1bda6fd52c2935755138391e08e096cd06a7aa8a6e8b43756f3b4d51af4996daadf0fa5cf', 'm3pUw4zLYr3sIPfnHjgX', '2009-12-11 22:24:37', '612snhiRwhiP2KSt7bW8', '3032a6fee64fcf5691fdbd7de4711f29bc49ed75b92f6a7fd68623ca44a82cae0a8e4186223d68389e5ef5ddee53b05e089eefb1a78e132852ff54d002e91d70', 'smsohan@ucalgary.ca', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save_without_session_maintenance

SELECT * FROM `users` WHERE (`users`.`id` = '13') LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '13') LIMIT 1
UPDATE `users` SET `updated_at` = '2009-12-12 18:29:19', `crypted_password` = '5882d3f901986431ecaa7c0ed2aa36c90c72d5e35f8d488dad45f7c67450324e9c77ddd883cc1136b16739b708c03020e52fd4795d5e27979e3b7b2d0e71cda5', `name` = 'Sohan', `perishable_token` = 'Bv4akspAoxN5vo96Xgjt', `password_salt` = 'DjNy5-_wxZxuKd9O70e-', `persistence_token` = '0814d212760b344b9edff7c87cc179c615de8beedf9eef764e0f83db7d7e9229c2a79557b7d52a55f3ed7d76bbf757f93d6f8ffcbbb2c9746cb40b00486ebce8' WHERE `id` = 13
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy